{
	"definitions": {
	},
	"properties": {
		"id": {
			"type": "primary key",
			"description": "Unique identifier for each fragiliry.",
		},
		"reviewer": {
			"type": "string",
			"description": "individual or institution repsonsible for documenting this particular fragility in the database.",
		},
		"source": {
			"type": "string",
			"description": "Original source of the fragility (i.e., did it come from an individual research paper or from the FEMA P-58 database).",
		},
		"basis": {
			"type": "string",
			"description": "Classification of the type of study conducted to develop the fragility. Where applicable, one of the following five study types should be selected: <'Experiment', 'Historical Event', 'Analytical Study', 'Lit Review', 'Other'>",
		},
		"num_observations": {
			"type": "number",
			"description": "The number of observations of component damage or response that make up this fragility.",
		},
		"reference_id": {
			"type": "foreign key",
			"description": "Unique identifier for a particular reference in db_reference.csv.",
		},
		"p58_fragility": {
			"type": "string",
			"description": "FEMA P-58 component ID. Empty if fragility is not associated with any FEMA P-58 fragility.",
		},
		"nistir_id": {
			"type": "foreign key",
			"description": "Unique identifier for a particular NISTIR category in db_nistir.csv.",
		},
		"comp_type": {
			"type": "string",
			"description": "Name of the NISTIR component category",
		},
		"sub_type": {
			"type": "string",
			"description": "Describes the major subgrouping of components within the NISTIR class. Can separate full system tests from individual components tests, or major types of components like full height from partial height walls.",
		},
		"connection_detail": {
			"type": "string",
			"description": "Describes the specific type of installation or connection type of the component, such as perimeter-fixed vs back-braced ceilings.",
		},
		"material_class": {
			"type": "string",
			"description": "Describes a general grouping of components based on material, i.e., light weight vs heavy weight ceiling tiles or CPVC vs iron sprinkler pipes.",
		},
		"size_class": {
			"type": "string",
			"description": "Describes a general grouping of components based on size, i.e., large gridded area of ceiling tiles or specific equipment size.",
		},
		"comp_description": {
			"type": "string",
			"description": "General description of the component, materials used, boundary conditions, and any other installation details.",
		},
		"edp": {
			"type": "string",
			"description": "Metric of peak amplitude at the onset of observed damage. Typically recorded in terms of building response or ground motion intensty measures that show the best correlation with damage to the component. Where applicable, one of the following seven units should be selected: <'Story Drift Ratio', 'Story Drift Ratio, bi-directional', 'Peak Floor Acceleration, Horizontal', 'Peak Floor Acceleration, Vertical'>.",
		},
		"edp_unit": {
			"type": "string",
			"description": "Unit of the edp metric, e.g., g, ratio, radians, kips, etc...",
		},
		"ds_rank": {
			"type": "integer",
			"description": "Damage state rank of this damage for a given component (e.g., first, second, third sequencial damage state observed).",
		},
		"ds_description": {
			"type": "string",
			"description": "General description of the damage observed, if any, under this test.",
		},
		"median": {
			"type": "number",
			"description": "Median value of the fit fragility for this given damage.",
		},
		"beta": {
			"type": "number",
			"description": "Dispersion value of the fit fragility for this given damage.",
		},
		"probability": {
			"type": "number",
			"description": "Probability of observing this particular damage among mutually exlusive damage states.",
		}
	}
}