{
	"definitions": {
	},
	"properties": {
		"id": {
			"type": "primary key",
			"description": "Unique identifier for each observation of experimental data.",
		},
		"reference_id": {
			"type": "foreign key",
			"description": "Unique identifier for a particular reference in db_reference.csv.",
		},
		"specimen": {
			"type": "string",
			"description": "Name of tested specimen, as noted by the author(s) in the reference document.",
		},
		"specimen_inspection_sequence": {
			"type": "integer",
			"description": "Test number of a particular specimen. Documented as the sequence integer of repeated test, i.e., this field would read '5', if this is the fifth test and inspection of this particular specimen.",
		},
		"reviewer": {
			"type": "string",
			"description": "Individual or institution responsible for documenting this particular observation of experimental data in the database.",
		},
		"nistir_id": {
			"type": "foreign key",
			"description": "Unique identifier for a particular NISTIR category in db_nistir.csv.",
		},
		"p58_db": {
			"type": "boolean",
			"description": "TRUE if this particular test was used to develop FEMA P-58 fragilities. FALSE otherwise.",
		},
		"p58_fragility": {
			"type": "string",
			"description": "FEMA P-58 component ID. Indicates experimental data used in the development of the FEMA P-58 fragilities. Empty if experimental data is not associated with any FEMA P-58 fragility.",
		},
		"comp_type": {
			"type": "string",
			"description": "Name of the NISTIR component category.",
		},
		"sub_type": {
			"type": "string",
			"description": "Describes the major subgrouping of components within the NISTIR class. Can separate full system tests from individual component tests, or major types of components like full height from partial height walls.",
		},
		"detailing": {
			"type": "string",
			"description": "Describes the specific type of installation or connection type of the component, such as perimeter-fixed vs back-braced ceilings.",
		},
		"material": {
			"type": "string",
			"description": "Describes a general grouping of components based on material, e.g., light weight vs heavy weight ceiling tiles or CPVC vs iron sprinkler pipes.",
		},
		"size_class": {
			"type": "string",
			"description": "Describes a general grouping of components based on size, e.g., large gridded area of ceiling tiles or specific equipment size.",
		},
		"test_type": {
			"type": "string",
			"description": "The type of test generally describing the condition under which the specimen was loaded. Where applicable, one of the following seven test_types should be selected: <'Dynamic, uniaxial', 'Dynamic, bi-directional', 'Dynamic, 3D', 'Monotonic, compression', 'Monotonic, tension', 'Quasi-static Cyclic, uniaxial', 'Quasi-static Cyclic, bi-directional'>",
		},
		"loading_protocol": {
			"type": "string",
			"description": "Name, ID, or general description of the ground motion or loading protocol used in the test.",
		},
		"peak_test_amplitude": {
			"type": "string",
			"description": "The maximum amplitude to which this test was performed. Description should include both the amplitude value, metric, and unit (e.g., 1.5 g Peak Ground Acceleration).",
		},
		"location": {
			"type": "string",
			"description": "The location where the test was conducted.",
		},
		"governing_design_standard": {
			"type": "string",
			"description": "Name of the standard governing the design of the specimen, if applicable.",
		},
		"design_objective": {
			"type": "string",
			"description": "General description of the performance level to which the specimen was designed, e.g., code compliant, common construction practice, low-damage-design, or meeting a certain damage objective under a specific loading condition.",
		},
		"comp_description": {
			"type": "string",
			"description": "General description of the component, materials used, boundary conditions, and any other installation details.",
		},
		"ds_description": {
			"type": "string",
			"description": "General description of the damage observed, if any, under this test.",
		},
		"prior_damage": {
			"type": "string",
			"description": "Description of any prior damage that was noted during a previous test of this specimen. Should also describe if and how the specimen was repaired prior to this test. Empty if no prior damage was noted.",
		},
		"prior_damage_repaired": {
			"type": "boolean",
			"description": "TRUE if prior damage was noted and repaired prior to this test. FALSE if prior damage was noted and not repaired.",
		},
		"edp_metric": {
			"type": "string",
			"description": "Metric of measure for the peak test amplitude at the onset of observed damage. Typically recorded in terms of building response or ground motion intensity measures that show the best correlation with damage to the component. Where possible, metrics should select from existing metrics used in other entries.",
		},
		"edp_unit": {
			"type": "string",
			"description": "Unit of the EDP metric recorded for this test. Where possible, metrics should select from existing metrics used in other entries.",
		},
		"edp_value": {
			"type": "number",
			"description": "Peak test amplitude at the onset of observed damage.",
		},
		"alt_edp_metric": {
			"type": "string",
			"description": "Secondary metric of measure for the peak test amplitude at the onset of observed damage.",
		},
		"alt_edp_unit": {
			"type": "string",
			"description": "Unit of the secondary EDP metric (alt_edp_metric) recorded for this test.",
		},
		"alt_edp_value": {
			"type": "number",
			"description": "Peak test amplitude at the onset of observed damage of the secondary EDP metric (alt_edp_metric).",
		},
		"ds_rank": {
			"type": "integer",
			"description": "Damage state rank provided by the original investigator (e.g., first, second, third sequential damage state observed). Empty if none provided by the investigator.",
		},
		"ds_class": {
			"type": "string",
			"description": "Classification of observed damage into one of the three categories: <'No damage', 'Inconsequential', 'Consequential'>. Where damage is unclear, select 'Unknown'.",
		},
		"notes": {
			"type": "string",
			"description": "General open field for documentation by reviewer.",
		}
	}
}
